app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'aliya'
 LIMIT 1
---
    public function prosesLogin()
    {
        $userModel = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)->first();