app/Controllers/Ibadah.php

    public function index()
{
    $model = new IbadahModel();
    $db = \Config\Database::connect();

    // Ambil data riwayat
    $data['riwayat'] = $model->orderBy('tanggal', 'DESC')->findAll();

    // Ambil data statistik
    $data['statistik'] = $db->table('riwayat_ibadah')
        ->select('tanggal, total_ibadah')
        ->orderBy('tanggal', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT `tanggal`, `total_ibadah`
FROM `riwayat_ibadah`
ORDER BY `tanggal` ASC